export interface QuizOption {
    label: string;
    score: number;
}

export interface QuizQuestion {
    id: number;
    text: string;
}

export const QUIZ_OPTIONS: QuizOption[] = [
    { label: "Зовсім не про мене", score: -2 },
    { label: "Скоріше про мене", score: -1 },
    { label: "Іноді так / іноді ні", score: 0 },
    { label: "Скоріше про мене", score: 1 },
    { label: "Повністю про мене", score: 2 },
];

export interface QuizCategory {
    id: string
    title: string
    description: string
}


export const QUIZ_CATEGORIES: QuizCategory[] = [
    {
        id: "agreeableness",
        title: "Доброзичливість",
        description: "Оцініть своє ставлення до інших людей, готовність співпрацювати та проявляти емпатію. Зверніть увагу, наскільки легко вам знаходити спільну мову з оточуючими та враховувати їхні почуття.",
    },
    {
        id: "extraversion",
        title: "Екстраверсія",
        description:
            "Оцініть свою потребу в спілкуванні, активності та взаємодії з іншими людьми. Зверніть увагу, наскільки комфортно ви почуваєтеся в соціальних ситуаціях і чи отримуєте енергію від спілкування.",
    },
    {
        id: "introversion",
        title: "Інтроверсія / саморефлексія",
        description:
            "Оцініть схильність до внутрішніх роздумів, самоаналізу та потребу в особистому просторі. Зверніть увагу, як часто ви звертаєтеся до своїх думок і почуттів для кращого розуміння себе.",
    },
    {
        id: "conscientiousness",
        title: "Сумлінність (організованість)",
        description:
            "Оцініть свою відповідальність, дисциплінованість та здатність планувати справи. Зверніть увагу, наскільки легко вам дотримуватися зобов’язань і доводити розпочате до кінця.",
    },
    {
        id: "emotional_stability",
        title: "Емоційна стабільність",
        description:
            "Оцініть свою здатність зберігати спокій і рівновагу в різних життєвих ситуаціях. Зверніть увагу, як часто ви відчуваєте сильний стрес, тривогу або емоційні коливання.",
    },
]



export const QUIZ_QUESTIONS: QuizQuestion[] = [
    {
        id: 1,
        text: "Мені легко знайомитися з новими людьми",
    },
    {
        id: 2,
        text: "Після спілкування з людьми я зазвичай відчуваю енергію",
    },
    {
        id: 3,
        text: "Я люблю бути в центрі уваги",
    },
    {
        id: 4,
        text: "Я легко починаю розмову з незнайомими людьми",
    },
    {
        id: 5,
        text: "Мені комфортно проводити час наодинці",
    },
    {
        id: 6,
        text: "Я швидко втомлююся від великої кількості спілкування",
    },
    {
        id: 7,
        text: "Я часто аналізую свої думки та поведінку",
    },
    {
        id: 8,
        text: "Я уникаю зайвих соціальних контактів, якщо можу",
    },
    {
        id: 9,
        text: "Я планую свої справи заздалегідь",
    },
    {
        id: 10,
        text: "Я зазвичай доводжу справи до кінця",
    },
    {
        id: 11,
        text: "Мені важливо, щоб усе було впорядковано",
    },
    {
        id: 12,
        text: "Я рідко відкладаю справи на потім",
    },
    {
        id: 13,
        text: "Я рідко сильно нервую у стресових ситуаціях",
    },
    {
        id: 14,
        text: "Я швидко заспокоююсь після конфліктів",
    },
    {
        id: 15,
        text: "Я зазвичай зберігаю спокій у складних ситуаціях",
    },
    {
        id: 16,
        text: "У мене рідко бувають різкі перепади настрою",
    },
    {
        id: 17,
        text: "Я легко співчуваю іншим людям",
    },
    {
        id: 18,
        text: "Я намагаюся уникати конфліктів",
    },
    {
        id: 19,
        text: "Я довіряю людям, поки не доведуть протилежне",
    },
    {
        id: 20,
        text: "Мені важливо підтримувати гармонійні стосунки з людьми",
    },
]